In [2]:
import pandas as pd
pd.set_option('display.max_columns', None)

In [14]:
hr_70_75 = pd.read_csv('1970-75.csv')
df = pd.DataFrame()

hr = hr_70_75.HR

df.insert(0, 'HR', hr)
df.HR = df.HR.sum()
df = df.drop(df.index.to_list()[1:], axis = 0)

hr_70_75 = df
hr_70_75.head()

      HR
0  17275

In [19]:
hr_76_80 = pd.read_csv('1976-80.csv')
df = pd.DataFrame()

hr = hr_76_80.HR


df.insert(0, 'HR', hr)
print(df)
df.HR = df.HR.sum()
df = df.drop(df.index.to_list()[1:], axis = 0)

hr_76_80 = df
hr_76_80.head()

     HR
0  2235
1  3644
2  2956
3  3433
4  3087

      HR
0  15355

In [16]:
hr_81_85 = pd.read_csv('1981-85.csv')
df = pd.DataFrame()

hr = hr_81_85.HR

df.insert(0, 'HR', hr)
df.HR = df.HR.sum()
df = df.drop(df.index.to_list()[1:], axis = 0)

hr_81_85 = df
hr_81_85.head()

      HR
0  15321

In [20]:
hr_86_90 = pd.read_csv('1986-90.csv')
df = pd.DataFrame()

hr = hr_86_90.HR

df.insert(0, 'HR', hr)
df.HR = df.HR.sum()
df = df.drop(df.index.to_list()[1:], axis = 0)

hr_86_90 = df
hr_86_90.head()

      HR
0  17851

In [21]:
hr_91_95 = pd.read_csv('1991-95.csv')
df = pd.DataFrame()

hr = hr_91_95.HRa

df.insert(0, 'HR', hr)
df.HR = df.HR.sum()
df = df.drop(df.index.to_list()[1:], axis = 0)

hr_91_95 = df
hr_91_95.head()

      HR
0  17838

In [23]:
hr_96_00 = pd.read_csv('1996-00.csv')
df = pd.DataFrame()

hr = hr_96_00.HR

df.insert(0, 'HR', hr)
df.HR = df.HR.sum()
df = df.drop(df.index.to_list()[1:], axis = 0)

hr_96_00 = df
hr_96_00.head()

      HR
0  25887

In [24]:
hr_01_05 = pd.read_csv('2001-05.csv')
df = pd.DataFrame()

hr = hr_01_05.HR

df.insert(0, 'HR', hr)
df.HR = df.HR.sum()
df = df.drop(df.index.to_list()[1:], axis = 0)

hr_01_05 = df
hr_01_05.head()

      HR
0  26192

In [25]:
hr_06_10 = pd.read_csv('2006-10.csv')
df = pd.DataFrame()

hr = hr_06_10.HR

df.insert(0, 'HR', hr)
df.HR = df.HR.sum()
df = df.drop(df.index.to_list()[1:], axis = 0)

hr_06_10 = df
hr_06_10.head()

      HR
0  24876

In [26]:
hr_11_15 = pd.read_csv('2011-15.csv')
df = pd.DataFrame()

hr = hr_11_15.HR

df.insert(0, 'HR', hr)
df.HR = df.HR.sum()
df = df.drop(df.index.to_list()[1:], axis = 0)

hr_11_15 = df
hr_11_15.head()

      HR
0  23242

In [27]:
hr_16_21 = pd.read_csv('2016-21.csv')
df = pd.DataFrame()

hr = hr_16_21.HR

df.insert(0, 'HR', hr)
df.HR = df.HR.sum()
df = df.drop(df.index.to_list()[1:], axis = 0)

hr_16_21 = df
hr_16_21.head()

      HR
0  32324

In [28]:
hr_data = pd.concat([hr_70_75, hr_76_80, hr_81_85, hr_86_90, hr_91_95, hr_96_00, hr_01_05, hr_06_10, hr_11_15, hr_16_21])

In [30]:
len(hr_data)

10

In [31]:
test_hr_data = hr_data

In [32]:
test_hr_data

      HR
0  17275
0  15355
0  15321
0  17851
0  17838
0  25887
0  26192
0  24876
0  23242
0  32324

In [33]:
years = ['1970-1975', '1976-1980', '1981-1985', '1986-1990', '1991-1995', '1996-2000', '2001-2005', '2006-2010', '2011-2015', '2016-2021']

In [34]:
test_hr_data.insert(0, 'Years', years)

In [35]:
test_hr_data

       Years     HR
0  1970-1975  17275
0  1976-1980  15355
0  1981-1985  15321
0  1986-1990  17851
0  1991-1995  17838
0  1996-2000  25887
0  2001-2005  26192
0  2006-2010  24876
0  2011-2015  23242
0  2016-2021  32324

In [36]:
test_hr_data.set_index('Years')

              HR
Years
1970-1975  17275
1976-1980  15355
1981-1985  15321
1986-1990  17851
1991-1995  17838
1996-2000  25887
2001-2005  26192
2006-2010  24876
2011-2015  23242
2016-2021  32324

In [37]:
test_hr_data = test_hr_data.reset_index(drop=True)

In [38]:
test_hr_data

       Years     HR
0  1970-1975  17275
1  1976-1980  15355
2  1981-1985  15321
3  1986-1990  17851
4  1991-1995  17838
5  1996-2000  25887
6  2001-2005  26192
7  2006-2010  24876
8  2011-2015  23242
9  2016-2021  32324

In [39]:
test_hr_data.set_index('Years', inplace=True)

In [40]:
test_hr_data

              HR
Years
1970-1975  17275
1976-1980  15355
1981-1985  15321
1986-1990  17851
1991-1995  17838
1996-2000  25887
2001-2005  26192
2006-2010  24876
2011-2015  23242
2016-2021  32324

In [41]:
hr_data = test_hr_data

In [42]:
hr_data.to_csv('hr_data.csv')